read_verilog ha.v
synth -top ha
write_json ha.json
show
