read_verilog xor_gate.v
synth -top xor_gate
write_json xor_gate.json
show
