read_verilog four_bit_comp.v
synth -top four_bit_comp
write_json four_bit_comp.json
show
