read_verilog alu_8bit.v
synth -top alu_8bit
write_json alu_8bit.json
show
