read_verilog inverter.v
synth -top inverter
write_json inverter.json
show
