read_verilog d_ff.v
synth -top d_ff
write_json d_ff.json
show
